/* Напишите программу, которая принимает два числа и проверяет, 
является ли первое число квадратом второго.

a = 25; b = 5 -> да
a = 2; b = 10 -> нет
a = 9; b = -3 -> да
a = -3; b = 9 -> нет
*/

Console.WriteLine("Введите два числа: ");
int number1 = convert.ToInt32(Console.readline());
int number2 = convert.ToInt32(Console.readline());