/* Напишите программу, которая принимает на вход трезначное число и на выходе
показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1
*/


Console.WriteLine("Введите трёхзначное число");

