/*
Напишите программу, которая на вход принимает число и выдаёт его квадрат
(число умноженное само на себя)


4 -> 16
-3 -> 9
-7 -> 49
*/

Console.Writeline("Введите число: ");

